if OS.mac?
    # taps
    tap "homebrew/bundle"
    tap "homebrew/cask"
    tap "homebrew/core"
    tap "homebrew/cask-fonts"

    # packages
    brew "bat" # better cat
    brew "cloc" # lines of code counter
    brew "git-delta" # a better git diff
    brew "entr" # file watcher / command runner
    brew "fd" # find alternative
    brew "fzf" # Fuzzy file searcher, used in scripts and in vim
    brew "gh" # GitHub CLI
    brew "git" # Git version control (latest version)
    brew "gnupg" # GPG
    brew "grep" # grep (latest)
    brew "highlight" # code syntax highlighting
    brew "htop" # a top alternative
    brew "jq" # work with JSON files in shell scripts
    brew "neofetch" # pretty system info
    brew "neovim" # A better vim
    # Python dependency management tool
    brew "pipenv"
    # Python version management
    brew "pyenv"
    # Interpreted, interactive, object-oriented programming language
    brew "python" # python (latst)
    brew "ripgrep" # very fast file searcher
    brew "fnm" # Fast Node version manager
    brew "shellcheck" # diagnostics for shell sripts
    brew "tmux" # terminal multiplexer
    brew "tree" # pretty-print directory contents
    brew "vim" # Vim (latest)
    brew "wdiff" # word differences in text files
    brew "wget" # internet file retriever
    brew "z" # switch between most used directories
    # Ruby environment tool
    brew "chruby"

    brew "noti" # utility to display notifications from scripts
    brew "trash" # rm, but put in the trash rather than completely delete

    # Applications
    cask '1password'
    cask 'caffeine'
    cask 'dbngin'
    cask 'discord'
    cask 'docker'
    cask 'figma'
    cask "kitty" # a better terminal emulator
    cask "imageoptim" # a tool to optimize images
	cask "1password/tap/1password-cli"
    cask 'zoom'
    cask 'tinkerwell'
    cask 'transmit'
    cask "google-chrome"
    cask "firefox"
    cask "visual-studio-code"
    # GitHub command-line tool
    brew "gh"
    # Platform built on V8 to build network applications
    brew "node"
    # Cryptography and SSL/TLS Toolkit
    brew "openssl@3"

    # Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
    brew "ruby-install"
    # Command-line shell and scripting language
    cask "powershell"

	# Quicklook
    cask 'qlmarkdown'
    cask 'quicklook-json'

    # Fonts
    cask "font-fira-code"
    cask "font-jetbrains-mono"
    cask "font-cascadia-mono"
    cask "font-3270-nerd-font"
    cask 'font-lato'
    cask 'font-open-sans'
    cask 'font-roboto'
    cask 'font-source-code-pro-for-powerline'
    cask 'font-source-code-pro'
    cask 'font-source-sans-pro'
    cask 'font-source-serif-pro'

elsif OS.linux?
    # Command-line shell and scripting language
    #brew "powershell"
    #brew "xclip" # access to clipboard (similar to pbcopy/pbpaste)
    #ßbrew "zsh" # zsh (latest)
end



